In [46]:
# PIVOT

import pandas as pd
import numpy as np

In [47]:
dias = pd.date_range(start="20190101", periods=12)

In [48]:
dias

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12'],
              dtype='datetime64[ns]', freq='D')

In [49]:
pessoa = ["George", "Victor", "Lucas"]

In [50]:
np.random.choice(pessoa)

'Lucas'

In [51]:
Nome = []
Gasto = []
for i in range(12):
    Nome.append(np.random.choice(pessoa))
    Gasto.append(np.round(np.random.rand()*100, decimals=2))
Nome

['George',
 'Lucas',
 'Victor',
 'Lucas',
 'Lucas',
 'George',
 'Lucas',
 'Victor',
 'George',
 'George',
 'George',
 'Lucas']

In [52]:
Gasto

[50.47, 81.33, 74.55, 2.06, 11.81, 23.72, 0.98, 9.6, 2.94, 56.01, 5.34, 14.38]

In [53]:
df = pd.DataFrame({"Dia":dias,
                   "Nome":Nome,
                   "Gasto":Gasto})
df

          Dia    Nome  Gasto
0  2019-01-01  George  50.47
1  2019-01-02   Lucas  81.33
2  2019-01-03  Victor  74.55
3  2019-01-04   Lucas   2.06
4  2019-01-05   Lucas  11.81
5  2019-01-06  George  23.72
6  2019-01-07   Lucas   0.98
7  2019-01-08  Victor   9.60
8  2019-01-09  George   2.94
9  2019-01-10  George  56.01
10 2019-01-11  George   5.34
11 2019-01-12   Lucas  14.38

In [56]:
pivot = df.pivot(index = "Dia", columns= "Nome", values = "Gasto")

In [79]:
pivot

Nome        George  Lucas  Victor
Dia
2019-01-01   50.47    NaN     NaN
2019-01-02     NaN  81.33     NaN
2019-01-03     NaN    NaN   74.55
2019-01-04     NaN   2.06     NaN
2019-01-05     NaN  11.81     NaN
2019-01-06   23.72    NaN     NaN
2019-01-07     NaN   0.98     NaN
2019-01-08     NaN    NaN    9.60
2019-01-09    2.94    NaN     NaN
2019-01-10   56.01    NaN     NaN
2019-01-11    5.34    NaN     NaN
2019-01-12     NaN  14.38     NaN

In [84]:
# Pivot_Table - pode usar o index com valores iguais
pivot_T = df.pivot_table(index = "Nome", columns= "Dia", values = "Gasto", aggfunc="sum")
pivot_T

Dia,2019-01-01,2019-01-02,2019-01-03,2019-01-04,2019-01-05,2019-01-06,2019-01-07,2019-01-08,2019-01-09,2019-01-10,2019-01-11,2019-01-12
Nome,,,,,,,,,,,,
George,50.47,NaN,NaN,NaN,NaN,23.72,NaN,NaN,2.94,56.01,5.34,NaN
Lucas,NaN,81.33,NaN,2.06,11.81,NaN,0.98,NaN,NaN,NaN,NaN,14.38
Victor,NaN,NaN,74.55,NaN,NaN,NaN,NaN,9.6,NaN,NaN,NaN,NaN